
** Under ABCL we fail to configure the filesystem

#+begin_src lisp
  (let ((i (jnew "org.not.parquet.simple.ParquetSimple")))
    (values
           (#"main" i (java:jarray-from-list '("foo")))
           i))
#+end_src

#+caption: additional error on Netbeans (but openjdk19)
#+begin_example
[repl-thread] WARNING org.apache.hadoop.util.NativeCodeLoader - Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
#+end_example


#+begin_src lisp
  (#"main" 'org.not.parquet.simple.ParquetSimple
           (jarray-from-list
            (list (namestring (truename "~/work/consensus-prototypes/xx")))))
#+end_src


#+begin_src lisp
    (java:add-to-classpath
     "~/work/parquet-simple/target/parquet-simple-1.0-SNAPSHOT-jar-with-dependencies.jar")
#+end_src

#+RESULTS:
| ~/work/parquet-simple/target/parquet-simple-1.0-SNAPSHOT-jar-with-dependencies.jar |


#+begin_example
  org.apache.hadoop.fs.UnsupportedFileSystemException: No FileSystem for scheme \"file\"
#+end_example

The problems seem to stem from something about the various Hadoop resources failing to load.

<https://hadoop.apache.org/docs/r2.4.1/api/org/apache/hadoop/conf/Configuration.html>
describes the use of a =core-default.xml= file loaded from the classpath for many common configurations.

#+caption: All resources loaded via explict --classpath
#+begin_src
(#"getClassLoader" (jss:find-java-class "org.apache.parquet.hadoop.util.HadoopInputFile"))
#<jdk.internal.loader.ClassLoaders$AppClassLoader jdk.internal.loader.ClassLoaders.... {70EA1D3E}>
#+end_src

#+caption: Hadoop loaded via ABCL-ASDF
#+begin_src 
(#"getClassLoader" (jss:find-java-class "org.apache.parquet.hadoop.util.HadoopInputFile"))
#<jdk.internal.loader.ClassLoaders$AppClassLoader jdk.internal.loader.ClassLoaders.... {70EA1D3E}>
#+end_src

